bivex/ArchC/tests/esp32c3/esp32c3_isa.H
/******************************************************
 * Instruction Set Architecture header file.          *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef _ESP32C3_ISA_H
#define _ESP32C3_ISA_H

#include "esp32c3_parms.H"
#include "ac_instr.H"
#include "ac_decoder_rt.H"
#include "ac_instr_info.H"
#include "esp32c3_arch.H"
#include "esp32c3_arch_ref.H"
#include "esp32c3_syscall.H"

namespace esp32c3_parms
{
class esp32c3_isa: public esp32c3_arch_ref {
private:
typedef ac_instr<AC_DEC_FIELD_NUMBER> ac_instr_t;

public:
  static ac_dec_field fields[AC_DEC_FIELD_NUMBER];
  static ac_dec_format formats[AC_DEC_FORMAT_NUMBER];
  static ac_dec_list dec_list[AC_DEC_LIST_NUMBER];
  static ac_dec_instr instructions[AC_DEC_INSTR_NUMBER];
  static const ac_instr_info instr_table[AC_DEC_INSTR_NUMBER + 1];

  static const unsigned instr_format_table[AC_DEC_INSTR_NUMBER + 1];

  ac_decoder_full* decoder;

  esp32c3_syscall syscall;
  //!Constructor.
  esp32c3_isa(esp32c3_arch& ref) : esp32c3_arch_ref(ref) , syscall(ref) {
    //!Building Decoder.
    decoder = ac_decoder_full::CreateDecoder(esp32c3_isa::formats, esp32c3_isa::instructions, &ref);
  }

  inline __attribute__((always_inline)) void _behavior_instruction(uint8_t op);

  inline __attribute__((always_inline)) void _behavior_begin();
  inline __attribute__((always_inline)) void _behavior_end();

  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_R(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_I(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_S(int8_t imm7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm5, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_B(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_U(uint32_t imm20, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_J(int8_t imm20, uint16_t imm10, uint8_t imm11, uint8_t imm8, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void _behavior_esp32c3_Type_H(uint8_t op, uint32_t pad);

  inline __attribute__((always_inline)) void behavior_add(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sub(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_and_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_or_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_xor_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sll_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_srl_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sra_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_slt(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sltu(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_mul_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_mulh_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_mulhu_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_div_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_divu_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_rem_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_remu_op(uint8_t funct7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_addi(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_andi(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_ori(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_xori(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_slli(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_srli(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_slti(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sltiu(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_jalr(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_lw(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_lh(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_lb(int16_t imm12, uint8_t rs1, uint8_t funct3, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sw(int8_t imm7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm5, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sh(int8_t imm7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm5, uint8_t op);
  inline __attribute__((always_inline)) void behavior_sb(int8_t imm7, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm5, uint8_t op);
  inline __attribute__((always_inline)) void behavior_beq(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_bne(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_blt(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_bge(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_bltu(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_bgeu(int8_t imm12, uint8_t imm10, uint8_t rs2, uint8_t rs1, uint8_t funct3, uint8_t imm4, uint8_t imm11, uint8_t op);
  inline __attribute__((always_inline)) void behavior_lui(uint32_t imm20, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_auipc(uint32_t imm20, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_jal(int8_t imm20, uint16_t imm10, uint8_t imm11, uint8_t imm8, uint8_t rd, uint8_t op);
  inline __attribute__((always_inline)) void behavior_halt(uint8_t op, uint32_t pad);

};
};



#endif //_ESP32C3_ISA_H

